2
3
1 1 1 2 2 1
0 0 0

2 
4
1 1 1 2 2 1 2 2 
0 0 0 0

2
3
1 1 1 2 2 1
1 1 2

2
3
1 1 1 2 2 1
1 1 1

3
2 
1 1 2 2
1 2


3
2 
1 1 2 2
1 1


3
2 
1 1 2 2
3 1



3
2 
1 1 2 2
4 1
/**
谢大，这两天我想了想我们队的问题：
之前我和俊哥哥（谬小俊）是和宇哥（程化宇）组队。宇哥的码力和思维都比我们两好多了，很多俊哥哥和我没想到地方宇哥就想到，并且用代码实现，因此我和俊哥哥对做出的题目很少进行过充分的思考，对各种情况也欠缺考虑；
另外宇哥的码力比我们好很多，思路没错的题目，他能够很快地敲出来（基本上就是他敲的）所以我和俊哥哥码力在多校的时候并没有锻炼起来。
这样看来我和俊哥哥在暑假除了见识多校里面的那些题和神队伍，补了一点点题目，长了几个单词，剩下的就是在抱宇哥大腿。
现在俊哥哥和我是和子恒组队，就没有大腿抱了，解题和代码都要亲力亲为的时候，才发现一个看似简单的题目a起来并不是看上去那么简单，常常就跪烂在小细节上面了，所以我们现在这个队的rank上窜下跳得厉害。

现在俊哥哥和我都在加强自己解题的能力（包括思维和码力），子恒也在做他的专题，1+1+1<1的情况会渐渐改变的，但是rank的话就不怎么能看了。
*/
